; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-69)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b9)
    (on-table b9)
    (clear b2)
    (on b2 b5)
    (on b5 b8)
    (on b8 b10)
    (on b10 b19)
    (on b19 b15)
    (on b15 b17)
    (on b17 b3)
    (on b3 b20)
    (on b20 b1)
    (on b1 b18)
    (on b18 b6)
    (on-table b6)
    (clear b14)
    (on b14 b4)
    (on-table b4)
    (clear b7)
    (on b7 b13)
    (on b13 b11)
    (on b11 b12)
    (on-table b12))
 (:goal (and 
(on b14 b9)
))
)

; plan
1. (unstack b16 b9)
   deleted: (on b16 b9) (clear b16) (arm-empty)
   added: (holding b16) (clear b9)
   goals met: 0 of 1
2. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
3. (unstack b14 b4)
   deleted: (on b14 b4) (clear b14) (arm-empty)
   added: (holding b14) (clear b4)
   goals met: 0 of 1
4. (stack b14 b9)
   deleted: (clear b9) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b9)
   goals met: 1 of 1
